БухЭксп/Catalogs/CW_ПодключаемыеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПодключаемыеОбъекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Встроенная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСубъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтладкаИмяОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасполагатьНаРабочемСтоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ТипыПодключаемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВстроеннойОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПредставленияПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяВерсияМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МетодыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомандыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяКоманда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступностьОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаПользователей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасположениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_РазделыРабочегоСтола</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВнешнейКоманды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетаданныеКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормыОбъкта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппыДоступаКоманды</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасположениеГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередЭлементом</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Макросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПодключаемыеОбъекты/Forms/ФормаНастроекВнешнейКоманды/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресНастроек) Тогда
		Настройки =  ПолучитьИзВременногоХранилища(Параметры.АдресНастроек);
		Если Настройки <> Неопределено Тогда
			ПараметрыВнешнейКоманды.Загрузить(Настройки);
			
			Для Каждого СтрокаПараметров из ПараметрыВнешнейКоманды Цикл
				
				Если ЭтоАдресВременногоХранилища(СтрокаПараметров.АдресГруппДоступа) Тогда
					
					МассивЗначений = ПолучитьИзВременногоХранилища(СтрокаПараметров.АдресГруппДоступа);
					Если МассивЗначений <> Неопределено Тогда
						СтрокаПараметров.ГруппыДоступа.ЗагрузитьЗначения(МассивЗначений);
					КонецЕсли;
					
				КонецЕсли;
				
				Если  СтрокаПараметров.ГруппыДоступа.Количество() = 0 Тогда
					СтрокаПараметров.ГруппыДоступа.Добавить(Справочники.CW_ГруппыПользователей.Администраторы);
					Модифицированность = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
			
		ОбновитьКартинкиСтрок();
		
		// выбираем из списка
		Если СписокКартинок.Количество() = 0 Тогда
			_ЗаполнитьСписокКартинок();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокТаблиныхЧастейОбъекта(МетаданныеКонфигурации, ИмяФормыОбъкта)
	
	ВыбраннаяФорма = ПолучитьФорму(СокрЛП(МетаданныеКонфигурации) + ".Форма." + ИмяФормыОбъкта);

	МассивИменФорм = Новый Массив;
	Для Каждого ЭлементФормы из ВыбраннаяФорма.Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = тип("ТаблицаФормы") Тогда
			МассивИменФорм.Добавить(ЭлементФормы.Имя);	
		КонецЕсли;
	КонецЦикла;

	Возврат МассивИменФорм;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокФормОбъекта(МетаданныеКонфигурации)
	
	Метаданное = ПолучитьОбъктМетаданных(МетаданныеКонфигурации);
	
	Если Метаданное = Неопределено тогда
		Возврат новый Массив;
	КонецЕсли;
	
	МассивИменФорм = Новый Массив;
	
	Для каждого ФормаОбъекта из Метаданное.Формы Цикл
		МассивИменФорм.Добавить(ФормаОбъекта.Имя);
	КонецЦикла;
	
	Возврат МассивИменФорм;
	
КонецФункции


&НаСервере
Функция ПолучитьОбъктМетаданных(МетаданныеКонфигурации)
	
	МассивТиповДанных = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(МетаданныеКонфигурации,".");
	
	ТипДанных = ""; ВидДанных = "";
	Если  МассивТиповДанных.Количество() > 0 Тогда
		ТипДанных = МассивТиповДанных[0];	
	КонецЕсли;
	Если  МассивТиповДанных.Количество() > 1 Тогда
		ВидДанных = МассивТиповДанных[1];	
	КонецЕсли;
	
	Если ТипДанных = "" или ВидДанных = "" тогда
		Возврат Неопределено;
	конецЕсли;
	
	Если ТипДанных = "Документ" Тогда
		Метаданное =	Метаданные.Документы[ВидДанных];
	ИначеЕсли ТипДанных = "Справочник" Тогда
		Метаданное =	Метаданные.Справочники[ВидДанных];
	ИначеЕсли ТипДанных = "Обработка" Тогда
		Метаданное =	Метаданные.Обработки[ВидДанных];
	КонецЕсли;
	
	Возврат Метаданное;
	
КонецФункции

&НаКлиенте
Процедура ПараметрыВнешнейКомандыИмяТабличнойЧастиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПараметрыВнешнейКоманды.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ИмяФормыОбъкта) тогда
		
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана форма объекта метаданных конфигуарции!";
		Сообщение.Сообщить();
		
		СтандартнаяОбработка = Ложь;
		Возврат;
		
	КонецЕсли;
	
	МассивИментабличныхЧастей = ПолучитьСписокТаблиныхЧастейОбъекта(ТекущиеДанные.МетаданныеКонфигурации, ТекущиеДанные.ИмяФормыОбъкта);
	Элемент.СписокВыбора.ЗагрузитьЗначения(МассивИментабличныхЧастей);
		
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВнешнейКомандыИмяФормыОбъктаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПараметрыВнешнейКоманды.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.МетаданныеКонфигурации) тогда
		
		СтандартнаяОбработка = Ложь;
		
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран объект метаданных конфигуарции!";
		Сообщение.Сообщить();
		
	КонецЕсли;	
	
	МассивИментабличныхЧастей = ПолучитьСписокФормОбъекта(ТекущиеДанные.МетаданныеКонфигурации);
	Элемент.СписокВыбора.ЗагрузитьЗначения(МассивИментабличныхЧастей);

КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	
	Если Не Проверитьдубли() Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);	
		ПоказатьВопрос(Оповещение,	"Не рекомендуется вызов команды из разных разделов формы!
									|Продолжить?",РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЭтаФорма.Закрыть(ПолучитьАдресНастроекКоманды());
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	
	ЭтаФорма.Закрыть(ПолучитьАдресНастроекКоманды());


КонецПроцедуры

&НаСервере
Функция Проверитьдубли() 
	
	ВремТаблица = ПараметрыВнешнейКоманды.Выгрузить();
	ВремТаблица.Свернуть("МетаданныеКонфигурации,ИмяФормыОбъкта","");
	
	Возврат ВремТаблица.Количество() = ПараметрыВнешнейКоманды.Количество();
	
КонецФункции

&наСервере
Функция ПолучитьАдресНастроекКоманды()
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрыВнешнейКоманды.Выгрузить());
	
КонецФункции

#Область Выбор_пиктограммы_команды

&НаКлиенте
Процедура ОбработкаВыбораПиктограммы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		ТекущаяСтрока = Элементы.ПараметрыВнешнейКоманды.ТекущаяСтрока;
		_ОбработатьВыборКартинки(Ответ.Значение, ТекущаяСтрока);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура ВыборКартинкиИзКоллекции(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораПиктограммы",ЭтотОбъект); 
	СписокКартинок.ПоказатьВыборЭлемента(ПОВ,"Выберите пиктограмму");
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборКартинкиОчистить(Команда)
	
	ТекущаяСтрока = Элементы.ПараметрыВнешнейКоманды.ТекущаяСтрока;
	
	_ОбработатьВыборКартинки("", ТекущаяСтрока);
	
КонецПроцедуры


&НаСервере
Процедура _ЗаполнитьСписокКартинок()
	
	СписокКартинок.Очистить();
	CW_ОбщегоНазначения.ЗаполнитьСписокКартинок(СписокКартинок); 
	
КонецПроцедуры

&НаСервере
Функция _ОбработатьВыборКартинки(тИмяКартинки, ИдентификаторСтроки)
	
	СтрокаКоманды = ПараметрыВнешнейКоманды.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если ЗначениеЗаполнено(тИмяКартинки) Тогда
		Картинка = БиблиотекаКартинок[тИмяКартинки]; 
	Иначе
		Картинка = Новый Картинка;
	КонецЕсли;
	
	СтрокаКоманды.ИмяКартинки 	= тИмяКартинки;
	СтрокаКоманды.Картинка 		= ПоместитьВоВременноеХранилище(Картинка,ЭтаФорма);
	
	Модифицированность = истина;
	
КонецФункции

&наСервере
Процедура ОбновитьКартинкиСтрок()
	
	Для Каждого СтрокаПараметров Из  ПараметрыВнешнейКоманды Цикл
		Если ЗначениеЗаполнено(СтрокаПараметров.ИмяКартинки) Тогда
			Картинка = БиблиотекаКартинок[СтрокаПараметров.ИмяКартинки]; 
		Иначе
			Картинка = Новый Картинка;
		КонецЕсли;
		СтрокаПараметров.Картинка = ПоместитьВоВременноеХранилище(Картинка,ЭтаФорма);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область Выбор_грппы_пользователй

&НаКлиенте
Процедура ПараметрыВнешнейКомандыГруппыДоступаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ИдентификаторСтроки = Элементы.ПараметрыВнешнейКоманды.ТекущаяСтрока;
	
	ПараметрыФормы 		= Новый Структура("АдресСписка", ПолучитьАдресСпискаПользователей(ИдентификаторСтроки));
	ОписаниеОповещения = новый ОписаниеОповещения("ПриЗакрытиФормыВыбораГруппыПользователей", ЭтаФорма, ИдентификаторСтроки);
	
	ОткрытьФорму("Справочник.CW_ПодключаемыеОбъекты.Форма.ФормаСпискаГрупПользователей",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСпискаПользователей(ИдентификаторСтроки)
	
	СтрокаТекущая = ПараметрыВнешнейКоманды.НайтиПоИдентификатору(ИдентификаторСтроки);

	Возврат ПоместитьВоВременноеХранилище(СтрокаТекущая.ГруппыДоступа.ВыгрузитьЗначения());
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытиФормыВыбораГруппыПользователей(Результат, ИдентификаторСтроки) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработатьРезультаВыбораГруппыПользователей(Результат, ИдентификаторСтроки);
		Модифицированность = истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультаВыбораГруппыПользователей(Результат, ИдентификаторСтроки)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		СтрокаТекущая = ПараметрыВнешнейКоманды.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		мВыбранныеЗначения = ПолучитьИзВременногоХранилища(Результат);	
		
		СтрокаТекущая.ГруппыДоступа.ЗагрузитьЗначения(мВыбранныеЗначения);
		
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти
